OF_Turorial_08/cavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            uMine;
        code
        #{
            const vectorField Cf = patch().Cf();
            vectorField uMine(Cf.size());
            scalar t = this->db().time().value();
            forAll(Cf,faceI)
            {
                uMine[faceI] = vector(t, t*t, 0);
            }
            operator==(uMine);

         #};
    }

    fixedWalls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
